"""
Практическое задание к уроку №1 курса "Базы данных и PyQt"
Студент: Максим Сапунов, Jenny6199@yandex.ru
Преподаватель: Сергей Акопович Акопян

Задача №1.
Написать функцию host_ping() в которой с помощью утилиты ping будет
проверяться доступность сетевых узлов. Аргументом функции является
список, в котором каждый сетевой узел должен быть представлен именем
хоста или ip-адрессом.
В функции необходимо перебирать ip-адреса и
проверять их доступность с выводом соответствующего сообщения
("Узел доступен", "Узел недоступен").
При этом ip-адресс сетвеого узла
должен создаваться с помощью функции ip-address().
"""
